# Это репозиторий для итоговой контрольной работы

## Задача

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Примеры

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]  
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]  
[“Russia”, “Denmark”, “Kazan”] → []  

## Решение

Для решения этой задачи используем стандартный перебор элементов массива и проверкой их длины.

1. Определяем функцию **_filter_short_strings_**, которая принимает исходный массив строк в качестве аргумента.

2. Создаем пустой массив **_output_array_**, который будет содержать строки, длина которых меньше или равна 3 символам.

3. Используем цикл **_for_** для перебора всех строк в исходном массиве.

4. Внутри цикла проверяем длину каждой строки с помощью функции **_len()_**. Если длина строки меньше или равна 3, добавляем эту строку в **_output_array_** с помощью метода **_append()_**.

5. После завершения цикла функция возвращает **_output_array_**, содержащий все строки, удовлетворяющие условию.

## Пример реализации

```sh
def filter_short_strings(input_array):
    # Создаем пустой массив для хранения строк с длиной <= 3 символа
    output_array = []
    
    # Перебираем все строки в исходном массиве
    for string in input_array:
        # Если длина строки <= 3, добавляем её в выходной массив
        if len(string) <= 3:
            output_array.append(string)
    
    return output_array

# Пример использования
input_array1 = ["Hello", "2", "world", ":-)"]
input_array2 = ["1234", "1567", "-2", "computer science"]
input_array3 = ["Russia", "Denmark", "Kazan"]

print(filter_short_strings(input_array1))  # Output: ["2", ":-)"]
print(filter_short_strings(input_array2))  # Output: ["-2"]
print(filter_short_strings(input_array3))  # Output: []
```

## Ссылка на репозиторий

Ссылка на репозиторий с итоговой контрольной работой по основному блоку https://github.com/mvsuslov/kontr-rab.git